docs/about.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 27, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>About</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">About</h1>
</header><p>
I am a professor of philosophy at <a href="https://www.okbu.edu">Oklahoma Baptist University</a>. As one of only two people in the department, I teach a number of different courses. Courses that are now in my regular rotation are Introduction to Philosophy, Philosophy of Religion, Symbolic Logic, Metaphysics, Epistemology, Aesthetics, and Existentialism. I also teach the history of philosophy sequence: ancient, early modern, medieval, and American. My past research has been on the nature and justification of religious belief, the relation of religious belief to ethics, the role of mystery in religious belief, and the problem of religious tolerance. My most recent work has been on the effects of social media on community, the use of literature for moral education, and economic justice and the law of jubilee. I am currently writing an open-source book on symbolic logic. I enjoy experimenting with technology, and spend more time trying out text editors than actually writing. Currently, I use Emacs on macOS, and a number of different applications on iOS, writing in either Org mode or LaTeX. I recently retired as a chaplain in the United States Army Reserve. My service included tours at Ft. Hood, Texas, Ft. Sill, Oklahoma, a deployment to Iraq in 2007, and a deployment to Afghanistan in 2013. I&rsquo;m particularly interested in the intersection of ethics, social and political philosophy, and economics. According to Matthew 6:10 — we are to pray:
</p>

<div class="org-center">
<p>
<i>&ldquo;Your kingdom come. Your will be done, on earth as it is in heaven.&rdquo;</i>
</p>
</div>

<p>
I take this to mean that we are to not simply wait for heaven, but to work to make this world more like heaven — that is, to work to develop just, sustainable communities in which all people are valued as bearers of the divine image. 
</p>

<p>
I live in Norman, Oklahoma, with my wife, Sheri, and our Goldendoodle, Lucy. We have one daughter, Rachael, who is married to her husband, Josh. 
</p>

<p>
This site is published using Emacs and Org mode, with the template provided by <a href="https://opensource.com/article/20/3/blog-emacs">Sachin Patel</a>.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 27, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
